# Predict survival from titanic crash using Naive bayes

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
#temp
df.Sex = df.Sex.map({'male': 1, 'female': 2})

In [5]:
df.head()

   Pclass  Sex   Age     Fare  Survived
0       3    1  22.0   7.2500         0
1       1    2  38.0  71.2833         1
2       3    2  26.0   7.9250         1
3       1    2  35.0  53.1000         1
4       3    1  35.0   8.0500         0

In [6]:
df.columns[df.isna().any()]

Index(['Age'], dtype='object')

In [7]:
df.Age[:10] # There is NaN value in age

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [8]:
df.Age = df.Age.fillna(df.Age.mean()) # fillna function is used to remove the NaN value . We are replacing the NaN value by mean og Age 
df.head()

   Pclass  Sex   Age     Fare  Survived
0       3    1  22.0   7.2500         0
1       1    2  38.0  71.2833         1
2       3    2  26.0   7.9250         1
3       1    2  35.0  53.1000         1
4       3    1  35.0   8.0500         0

In [9]:
X = df.iloc[:,[0,1,2,3]].values  
Y = df.iloc[:,4].values

In [10]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.3)

In [11]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [12]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [13]:
model.score(X_test,y_test)

0.7798507462686567

In [14]:
X_test[0:10]

array([[  1.        ,   2.        ,  33.        ,  53.1       ],
       [  1.        ,   1.        ,  48.        ,  76.7292    ],
       [  3.        ,   2.        ,  29.69911765,   7.75      ],
       [  1.        ,   2.        ,  41.        , 134.5       ],
       [  1.        ,   2.        ,  24.        ,  69.3       ],
       [  3.        ,   1.        ,  42.        ,   8.4042    ],
       [  1.        ,   1.        ,  58.        , 113.275     ],
       [  3.        ,   1.        ,  29.69911765,  15.2458    ],
       [  3.        ,   2.        ,  29.69911765,  15.5       ],
       [  2.        ,   1.        ,  18.        ,  11.5       ]])

In [15]:
y_test[0:10]

array([1, 1, 0, 1, 1, 0, 0, 1, 1, 0], dtype=int64)

In [17]:
model.predict(X_test[0:10])

array([1, 1, 0, 1, 1, 0, 1, 0, 0, 0], dtype=int64)